// Κατασκευάστε μια ταμειακή μηχανή η οποία υπολογίζει το
// πληρωτέο σύνολο ενός πελάτη. Να αναπτύξετε πρόγραμμα:
// i. Να εκτυπώνει το μήνυμα «ΔΩΣΕ ΤΙΜΗ ΠΡΟΪΟΝΤΟΣ» και να διαβάζει
// την τιμή του προϊόντος.
// ii. Να επαναλαμβάνει τη διαδικασία μέχρι να δοθεί τιμή προϊόντος 0.
// iii. Να εμφανίζει την έκφραση «ΠΛΗΡΩΤΕΟ ΠΟΣΟ» και το ποσό που θα
// πρέπει να πληρώσει ο πελάτης.

#include<stdio.h>

int main (){
float price = 1; 
float totprice =0;

do{
printf("give product price \n");
scanf("%f",&price);
totprice  = totprice + price ;
}

while (price != 0);

printf("total price is  %.2f\n",totprice);
return 0 ; 
}