// //10. Να γραφεί πρόγραμμα το οποίο να δέχεται την εισαγωγή
// //βαθμολογίας για ένα φοιτητή (πραγματικός αριθμός στο
// //διάστημα 0-10) . Μετά την εισαγωγή κάθε βαθμού να υπάρχει
// //η ερώτηση αν ο χρήστης θα εισάγει άλλο βαθμό. Με το
// //πλήκτρο “Y” ή “y” να γίνεται νέα εισαγωγή, ενώ με οτιδήποτε
// //άλλο να τελειώνει η επαναληπτική διαδικασία. Το πρόγραμμα
// //να υπολογίζει και να εμφανίζει το άθροισμα και το μέσο όρο
// //της βαθμολογίας, καθώς και την ελάχιστη και μέγιστη
// //βαθμολογία.



// #include<stdio.h>

// int main(){
 
//  char c ;
//  float b,sum,mo,m,e ;

//  sum= 0; 
//  e = 10 ;
//  m = 0 ; 
//  mo = 0 ;

//  do {

//    printf("dose enen arithmo");

//    scanf ("%f",&b);

//    sum ++;

//  mo = mo  + b;

//  if (m < b){
//     m = b;
//  }

//   else if ( b < e){
//     e = b;
//  }





//  }

 
 






// }