
    //Γράψτε ένα πρόγραμμα το οποίο να διαβάζει συνεχώς ακέραιους
    //αριθμούς μέχρι ο χρήστης να εισάγει το 0. Στο τέλος, το
   //πρόγραμμα να εμφανίζει το πλήθος των θετικών και αρνητικών
   //αριθμών που εισήγαγε ο χρήστης. Το μηδέν να μην προσμετράται
   // ούτε στους θετικούς ούτε στους αρνητικούς αριθμούς


#include <stdio.h>
    int main (){

     int i ,pos,neg;
       pos=neg=0;
     while (1)
     {
        printf("DOSE ENEN AKEREO ARITHMO");

        scanf("%d",&i);
        if ( i == 0)
        break;

        else if(i>0)
        pos++;

        else
        neg++;

     }
     
     

printf("pos =%d neg = %d\n",pos,neg);


       return 0 ; 
    }